---
kind: property
id: P:Autodesk.Revit.DB.Visual.Tile.TextureWAngle
source: html/8a710a00-fae4-ee68-fd45-68798a361ac5.htm
---
# Autodesk.Revit.DB.Visual.Tile.TextureWAngle Property

The property labeled "Angle" from the "Tile" schema.

## Syntax (C#)
```csharp
public static string TextureWAngle { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 360".